lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
      // 最後の1回は mixdata の取得を省略(a6に取得しておいた値を再利用する)
      "extui    a7,  a3,  24,  6          \n"  // 1ピクセル目 6ビット取得
      "add.n    a5,  a14, a5              \n"  // a5 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // 1ピクセル目のデータを左16bitシフト
      "add.n    a8,  a7,  a6              \n"  // a8 = 1ピクセル目+mixdata
      "extui    a7,  a4,  24,  6          \n"  // 2ピクセル目 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = 2ピクセル目+a8
      "s32i.n   a7,  a5,  0               \n"  // a7 の値を出力先にセット

"HUB75_DRAW332_LOOP_END:            \n"

      "l32i.n  a4,  a2,  28               \n" // a4に xe_idx を代入
      "l32i.n  a5,  a2,  20               \n" // a5に xe_tbl を代入
      "l32i.n  a9,  a2,  40               \n" // a9に mixdata テーブル更新用の値を取得
      "beqi    a4,  5,   HUB75_EXIT332    \n" // xe_idx が終端に達していたら処理を終える
      "addx2   a6,  a4,  a5               \n" // a6 に xeテーブル現在インデクスのアドレス
      "l16ui   a3,  a6,  0                \n" // a3 に現在の xe値
      "srli    a3 , a3,  1                \n" // a3 >>= 1
// ここから mixdata の値を更新、 xe の位置を再設定
"HUB75_BR332LOOP_START:             \n"
        "mov     a5,  a3                    \n" // a5 に前の xe値 を移す
        "l16ui   a3,  a6,  2                \n" // a3 に新しい xe値 を代入
        "addi.n  a6,  a6,  2                \n" // a6 xeテーブル位置をひとつ進める
        "addi.n  a4,  a4,  1                \n" // a4 ++xe_idx
        "addx4   a8,  a4,  a15              \n" // A8 に更新対象の mixdata のアドレスをセット
        "s32i.n  a9,  a8,  0                \n" // mixdata 更新
        "srli    a3,  a3,  1                \n" // A3 >>= 1
      "bge     a5,  a3,  HUB75_BR332LOOP_START     \n" // xe 値が同値なら BR_LOOP 再トライ
      "s32i.n  a4,  a2,  28               \n" // xe_idx の値を保存
      "sub     a3,  a3,  a5               \n" // 新しい xe値から前回のxe値を引き、差分を得る
      "j HUB75_DRAW332_LOOP_START         \n" // a3 (xe) の位置が刷新されたので再度先頭からループ

"HUB75_EXIT332:                   \n"

      "l32i   a0,  a2,  44                \n"
      );
  }

  static void hub75Draw565_asm(asm_work_t* work)
  {
/* 関数が呼び出された直後のレジスタの値
    a0 : リターンアドレス (workに退避し、a0を別の用途に使用)
    a1 : スタックポインタ (変更不可)
    a2 : asm_work_t*      (変更せずそのまま利用する)
*/
    __asm__ __volatile__ (
      "s32i.n  a0,  a2,  44               \n" // A0 を退避
      "l32i.n  a3,  a2,  32               \n" // a3  = xe
      "l32i.n  a0,  a2,  0                \n" // ★a0  = 出力先アドレス
      "l32i.n  a11, a2,  4                \n" // ★a11 = パネル上側の元データ配列
      "l32i.n  a12, a2,  8                \n" // ★a12 = パネル下側の元データ配列
      "l32i.n  a13, a2,  12               \n" // ★a13 = pixel_tbl
      "l32i.n  a14, a2,  24               \n" // ★a14 = len32
      "movi    a15, 0b111000111000111000111000111   \n"  // A15 にマスクパターンをセット
      "s32i.n  a15, a2,  36               \n" // マスクパターンをworkに退避
      "slli    a14, a14, 2                \n" // len32 を 4倍(d32の加算に使うため)

"HUB75_DRAW565_LOOP_START:          \n"

      "loop    a3, HUB75_DRAW565_LOOP_END \n" // ループ開始 (a3 にループ回数 xe がセットされた状態でここに来ること)

      "l32i.n  a5,  a11, 0                \n" // a5 = 元データ配列から swap565形式 2ピクセル まとめて取得
      "addi.n  a11, a11, 4                \n" // 元データのアドレスを4進める
      "l32i.n  a6,  a12, 0                \n" // a6 = 元データ配列から swap565形式 2ピクセル まとめて取得
      "addi.n  a12, a12, 4                \n" // 元データのアドレスを4進める

//////////////////

      "extui   a7,  a5,  0,   5           \n" // a7  = 青成分取得
      "addx8   a7,  a7,  a13              \n" // a7  = テーブルアドレスに変換 (5bitデータを元にuint32_t[64]のテーブルを引くため x8する)
      "l32i.n  a7,  a7,  4                \n" // a7  = pixel_tbl[青成分]
      "extui   a8,  a5,  5,   6           \n" // a8  = 緑成分取得
      "addx4   a8,  a8,  a13              \n" // a8  = テーブルアドレスに変換 (6bitデータを元にuint32_t[64]のテーブルを引くため x4する)
      "l32i.n  a8,  a8,  0                \n" // a8  = pixel_tbl[緑成分]
      "extui   a9,  a5,  11,  5           \n" // a9  = 赤成分取得
      "addx8   a9,  a9,  a13              \n" // a9  = テーブルアドレスに変換 (5bitデータを元にuint32_t[64]のテーブルを引くため x8する)
      "l32i.n  a9,  a9,  4                \n" // a9  = pixel_tbl[赤成分]
      "addx2   a3,  a7,  a8               \n" // a3  = (B << 1) + G

      // a9のロード待ちのため、先の処理を間に挟む
      "extui   a7,  a6,  0,   5           \n" // a7  = 青成分取得

      "addx2   a3,  a3,  a9               \n" // a3  = (BG << 1) + R 1ピクセル目 上側の RGB成分 完成

//////////////////

      "addx8   a7,  a7,  a13              \n" // a7  = テーブルアドレスに変換
      "l32i.n  a7,  a7,  4                \n" // a7  = pixel_tbl[青成分]
      "extui   a8,  a6,  5,   6           \n" // a8  = 緑成分取得
      "addx4   a8,  a8,  a13              \n" // a8  = テーブルアドレスに変換
      "l32i.n  a8,  a8,  0                \n" // a8  = pixel_tbl[緑成分]
      "extui   a9,  a6,  11,  5           \n" // a9  = 赤成分取得
      "addx8   a9,  a9,  a13              \n" // a9  = テーブルアドレスに変換
      "l32i.n  a9,  a9,  4                \n" // a9  = pixel_tbl[赤成分]
      "addx2   a4,  a7,  a8               \n" // a4  = (B << 1) + G

      // a9のロード待ちのため、先の処理を間に挟む
      "extui   a7,  a5,  16,  5           \n" // a7  = 青成分取得

      "addx2   a4,  a4,  a9               \n" // a4  = (BG << 1) + R 1ピクセル目 下側の RGB成分 完成

//////////////////

      "addx8   a7,  a7,  a13              \n" // a7  = テーブルアドレスに変換
      "l32i.n  a7,  a7,  4                \n" // a7  = pixel_tbl[青成分]
      "extui   a8,  a5,  21,  6           \n" // a8  = 緑成分取得
      "addx4   a8,  a8,  a13              \n" // a8  = テーブルアドレスに変換
      "l32i.n  a8,  a8,  0                \n" // a8  = pixel_tbl[緑成分]
      "extui   a9,  a5,  27,  5           \n" // a9  = 赤成分取得
      "addx8   a9,  a9,  a13              \n" // a9  = テーブルアドレスに変換
      "l32i.n  a9,  a9,  4                \n" // a9  = pixel_tbl[赤成分]
      "addx2   a5,  a7,  a8               \n" // a5  = (B << 1) + G

      // a9のロード待ちのため、先の処理を間に挟む
      "extui   a7,  a6,  16,  5           \n" // a7  = 青成分取得

      "addx2   a5,  a5,  a9               \n" // a5  = (BG << 1) + R 2ピクセル目 上側の RGB成分 完成

//////////////////

      "addx8   a7,  a7,  a13              \n" // a7  = テーブルアドレスに変換
      "l32i.n  a7,  a7,  4                \n" // a7  = pixel_tbl[青成分]
      "extui   a8,  a6,  21,  6           \n" // a8  = 緑成分取得
      "addx4   a8,  a8,  a13              \n" // a8  = テーブルアドレスに変換
      "l32i.n  a8,  a8,  0                \n" // a8  = pixel_tbl[緑成分]
      "extui   a9,  a6,  27,  5           \n" // a9  = 赤成分取得
      "addx8   a9,  a9,  a13              \n" // a9  = テーブルアドレスに変換
      "l32i.n  a9,  a9,  4                \n" // a9  = pixel_tbl[赤成分]

      // a9のロード待ちのため、先の処理を間に挟む
      "l32i.n  a15, a2,  36               \n" // a15にマスクパターンを読み込み

      "addx2   a6,  a7,  a8               \n" // a6  = (B << 1) + G
      "addx2   a6,  a6,  a9               \n" // a6  = (BG << 1) + R 2ピクセル目 下側の RGB成分 完成

// この時点で a3,a4,a5,a6 に 合計4ピクセル分のデータが入った状態になっている
// ここから、パネル上側と下側のRGB成分が隣接し6bit単位となった状態に変換する

      "and     a7,  a15, a3               \n"  // a7  = upper_1_odd
      "and     a8,  a15, a4               \n"  // a8  = lower_1_odd
      "and     a9,  a15, a5               \n"  // a9  = upper_2_odd
      "and     a10, a15, a6               \n"  // a10 = lower_2_odd
      "slli    a15, a15, 3                \n"  // a15 マスクパターンを反転
      "and     a3,  a15, a3               \n"  // a3  = upper_1_even
      "and     a4,  a15, a4               \n"  // a4  = lower_1_even
      "and     a5,  a15, a5               \n"  // a5  = upper_2_even
      "and     a6,  a15, a6               \n"  // a6  = lower_2_even

