lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
// 出力処理の準備
      "l32i.n  a15, a2,  16               \n"  // a15 に mixdata アドレスを代入

      "addx8   a6,  a6,  a5               \n"  // a6 = (lower_2_even << 3) + upper_2_even
      "addx8   a5,  a4,  a3               \n"  // a5 = (lower_1_even << 3) + upper_1_even
      "addx8   a4,  a10, a9               \n"  // a4 = (lower_2_odd << 3) + upper_2_odd
      "addx8   a3,  a8,  a7               \n"  // a3 = (lower_1_odd << 3) + upper_1_odd

      "l32i.n  a10, a15, 28               \n"  // a7 に mixdata末尾の値を代入 (7*sizeof(uint32_t) = 28)
      "mov.n   a9,  a0                    \n"  // a9 に 出力先 アドレスをコピー
      "addi.n  a0,  a0,  4                \n"  // ★a0 出力先アドレス を1進める

      "srli    a5,  a5,  3                \n"  // a5 = 1_even >> 3
      "srli    a6,  a6,  3                \n"  // a6 = 2_even >> 3

      "s32i.n  a10, a9,  0                \n"  // mixdata 末尾のデータを出力先にセット

// ここから出力
// RGB成分 と mixdata(Y座標情報) を合わせた16bitデータを2ピクセル分32bit纏めて出力 を 8回(TRANSFER_PERIOD_COUNT) 行う

      "l32i.n   a8,  a15, 0               \n"  // a8  = mixdata[0]
      "extui    a7,  a3,  0,   6          \n"  // a7 = a3 odd1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // a9 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // odd1のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = odd1 + tmp
      "extui    a7,  a4,  0,   6          \n"  // a7 = a4 odd2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット

      "l32i.n   a8,  a15, 4               \n"  // a8 = mixdata[1]
      "extui    a7,  a5,  0,   6          \n"  // a7 = a5 even1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // even1のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = odd1 + tmp
      "extui    a7,  a6,  0,   6          \n"  // a7 = a6 even2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット


      "l32i.n   a8,  a15, 8               \n"  // a8  = mixdata[2]
      "extui    a7,  a3,  6,   6          \n"  // a7 = a3 odd1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // a9 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // odd1のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = odd1 + tmp
      "extui    a7,  a4,  6,   6          \n"  // a7 = a4 odd2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット

      "l32i.n   a8,  a15, 12              \n"  // a8 = mixdata[3]
      "extui    a7,  a5,  6,   6          \n"  // a7 = a5 even1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // even1のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = odd1 + tmp
      "extui    a7,  a6,  6,   6          \n"  // a7 = a6 even2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット


      "l32i.n   a8,  a15, 16              \n"  // a8  = mixdata[4]
      "extui    a7,  a3,  12,  6          \n"  // a7 = a3 odd1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // a9 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // odd1のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = odd1 + tmp
      "extui    a7,  a4,  12,  6          \n"  // a7 = a4 odd2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット

      "l32i.n   a8,  a15, 20              \n"  // a8 = mixdata[5]
      "extui    a7,  a5,  12,  6          \n"  // a7 = a5 even1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // even1のデータを左16bitシフト
      "add.n    a8,  a7,  a8              \n"  // a8 = odd1 + tmp
      "extui    a7,  a6,  12,  6          \n"  // a7 = a6 even2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット

      // 最後の2回は mixdata の取得を省略(a10に取得しておいた値を再利用する)
      "srli     a7,  a3,  18              \n"  // a7 = a3 odd1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // a9 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // odd1のデータを左16bitシフト
      "add.n    a8,  a7,  a10             \n"  // a8 = odd1 + tmp
      "srli     a7,  a4,  18              \n"  // a7 = a4 odd2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット

      "srli     a7,  a5,  18              \n"  // a7 = a5 even1 6ビット取得
      "add.n    a9,  a14, a9              \n"  // 出力先アドレス += len32
      "slli     a7,  a7,  16              \n"  // even1のデータを左16bitシフト
      "add.n    a8,  a7,  a10             \n"  // a8 = odd1 + tmp
      "srli     a7,  a6,  18              \n"  // a7 = a6 even2 6ビット取得
      "add.n    a7,  a7,  a8              \n"  // a7 = odd2 + mixdata
      "s32i.n   a7,  a9,  0               \n"  // a7 の値を出力先にセット

"HUB75_DRAW565_LOOP_END:                     \n"

      "l32i.n  a4,  a2,  28               \n" // a4に xe_idx を代入
      "l32i.n  a5,  a2,  20               \n" // a5に xe_tbl を代入
      "l32i.n  a9,  a2,  40               \n" // a9に mixdata テーブル更新用の値を取得
      "beqi    a4,  8,   HUB75_EXIT565    \n" // xe_idx が終端に達していたら処理を終える
      "addx2   a6,  a4,  a5               \n" // a6 に xeテーブル現在インデクスのアドレス
      "l16ui   a3,  a6,  0                \n" // a3 に現在の xe値
      "srli    a3 , a3,  1                \n" // a3 >>= 1
// ここから mixdata の値を更新、 xe の位置を再設定
"HUB75_BR565LOOP_START:             \n"
        "mov     a5,  a3                    \n" // a5 に前の xe値 を移す
        "l16ui   a3,  a6,  2                \n" // a3 に新しい xe値 を代入
        "addi.n  a6,  a6,  2                \n" // a6 xeテーブル位置をひとつ進める
        "addi.n  a4,  a4,  1                \n" // a4 ++xe_idx
        "addx4   a8,  a4,  a15              \n" // A8 に更新対象の mixdata のアドレスをセット
        "s32i.n  a9,  a8,  0                \n" // mixdata 更新
        "srli    a3,  a3,  1                \n" // A3 >>= 1
      "bge     a5,  a3,  HUB75_BR565LOOP_START     \n" // xe 値が同値なら BR_LOOP 再トライ
      "s32i.n  a4,  a2,  28               \n" // xe_idx の値を保存
      "sub     a3,  a3,  a5               \n" // 新しい xe値から前回のxe値を引き、差分を得る
      "j HUB75_DRAW565_LOOP_START         \n" // a3 (xe) の位置が刷新されたので再度先頭からループ


"HUB75_EXIT565:                   \n"

      "l32i   a0,  a2,  44                \n"
      );
  }

