lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
/*
// C++版 draw332
  static void hub75Draw332_cpp(asm_work_t* work)
  {
    uint8_t* src8_h = (uint8_t*)(work->s32h);
    uint8_t* src8_l = (uint8_t*)(work->s32l);
    uint32_t* d32 = work->d32;
    uint32_t len32 = work->len32;
    uint32_t xe = work->xe;
    uint32_t xe_idx = work->xe_idx;
    auto mixdata = work->mixdata;
    auto xe_tbl = work->xe_tbl;
    for (;;)
    {
      do
      {
        // RGB332の値を基にガンマテーブルを適用する
        // このテーブルの中身は単にガンマ補正をするだけでなく、
        // BGR順に1ビットずつ並んだ状態に変換する処理を兼ねている。
        uint32_t rgb_upper_1 = work->pixel_tbl[*src8_h++];
        uint32_t rgb_upper_2 = work->pixel_tbl[*src8_h++];
        uint32_t rgb_lower_1 = work->pixel_tbl[*src8_l++];
        uint32_t rgb_lower_2 = work->pixel_tbl[*src8_l++];

        // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
        uint32_t rgb_1 = rgb_upper_1 + (rgb_lower_1 << 3);
        uint32_t rgb_2 = rgb_upper_2 + (rgb_lower_2 << 3);

        d32[len32 * 0] = mixdata[5]; // [TRANSFER_PERIOD_COUNT_332];

        int32_t i = 0;
        uint32_t pixel_2 = rgb_2 & 0x3F;
        uint32_t pixel_1 = rgb_1 & 0x3F;
        pixel_2 += mixdata[i];
        pixel_1 <<= 16;
        d32[++i * len32] = pixel_1 + pixel_2;
        do
        {
          rgb_2 >>= 6;
          rgb_1 >>= 6;
          pixel_2 = rgb_2 & 0x3F;
          pixel_1 = rgb_1 & 0x3F;
          pixel_2 += mixdata[i];
          pixel_1 <<= 16;
          // 横２列ぶん同時にバッファにセットする
          d32[++i * len32] = pixel_1 + pixel_2;
        } while (i < 5);  // TRANSFER_PERIOD_COUNT_332;

        ++d32;
      } while (--xe);
      if (xe_idx == 5) break; // TRANSFER_PERIOD_COUNT_332
      uint32_t new_xe = xe_tbl[xe_idx] >> 1;
      uint32_t old_xe;
      do {
        old_xe = new_xe;
        mixdata[++xe_idx] = work->mix_value;
        new_xe = xe_tbl[xe_idx] >> 1;
      } while (new_xe <= old_xe);
      xe = new_xe - old_xe;
    }
  }

 // C++版 draw565
  static void hub75Draw565_cpp(asm_work_t* work)
  {
    uint32_t* d32 = work->d32;
    uint32_t len32 = work->len32;
    uint32_t xe = work->xe;
    uint32_t xe_idx = work->xe_idx;
    auto pixel_tbl = work->pixel_tbl;
    auto mixdata = work->mixdata;
    auto xe_tbl = work->xe_tbl;

    for (;;)
    {
      do
      {
        // 16bit RGB565を32bit変数に2ピクセル纏めて取り込む。(画面の上半分用)
        uint32_t rgb565x2_upper = *work->s32h++;
        // 画面の下半分用のピクセルも同様に2ピクセル纏めて取り込む
        uint32_t rgb565x2_lower = *work->s32l++;

        // R,G,Bそれぞれの成分に分離する。2x2=4ピクセルまとめて処理することで演算回数を削減する
        uint32_t r_upper_1 = rgb565x2_upper >> 11;
        uint32_t r_lower_1 = rgb565x2_lower >> 11;
        uint32_t g_upper_1 = rgb565x2_upper >> 5;
        uint32_t g_lower_1 = rgb565x2_lower >> 5;
        uint32_t b_upper_2 = rgb565x2_upper & 0x1F001F;
        uint32_t b_lower_2 = rgb565x2_lower & 0x1F001F;
        uint32_t r_upper_2 = r_upper_1 & 0x1F001F;
        uint32_t r_lower_2 = r_lower_1 & 0x1F001F;
        uint32_t g_upper_2 = g_upper_1 & 0x3F003F;
        uint32_t g_lower_2 = g_lower_1 & 0x3F003F;

        r_upper_1 = r_upper_2 & 0x1F;
        r_lower_1 = r_lower_2 & 0x1F;
        r_upper_2 >>= 16;
        r_lower_2 >>= 16;
        g_upper_1 = g_upper_2 & 0x3F;
        g_lower_1 = g_lower_2 & 0x3F;
        g_upper_2 >>= 16;
        g_lower_2 >>= 16;
        uint32_t b_upper_1 = b_upper_2 & 0x1F;
        uint32_t b_lower_1 = b_lower_2 & 0x1F;
        b_upper_2 >>= 16;
        b_lower_2 >>= 16;

        // RGBそれぞれ64階調値を元にガンマテーブルを適用する
        // このテーブルの中身は単にガンマ補正をするだけでなく、
        // 各ビットを3bit間隔に変換する処理を兼ねている。
        // 具体的には  0bABCDEFGH  ->  0bA__B__C__D__E__F__G__H__ のようになる
        r_upper_1 = pixel_tbl[r_upper_1 << 1];
        r_lower_1 = pixel_tbl[r_lower_1 << 1];
        r_upper_2 = pixel_tbl[r_upper_2 << 1];
        r_lower_2 = pixel_tbl[r_lower_2 << 1];
        g_upper_1 = pixel_tbl[g_upper_1];
        g_lower_1 = pixel_tbl[g_lower_1];
        g_upper_2 = pixel_tbl[g_upper_2];
        g_lower_2 = pixel_tbl[g_lower_2];
        b_upper_1 = pixel_tbl[b_upper_1 << 1];
        b_lower_1 = pixel_tbl[b_lower_1 << 1];
        b_upper_2 = pixel_tbl[b_upper_2 << 1];
        b_lower_2 = pixel_tbl[b_lower_2 << 1];

        // テーブルから取り込んだ値は3bit間隔となっているので、
        // R,G,Bそれぞれが互いを避けるようにビットシフトすることでまとめることができる。
        g_upper_1 += b_upper_1 << 1;
        g_lower_1 += b_lower_1 << 1;
        g_upper_2 += b_upper_2 << 1;
        g_lower_2 += b_lower_2 << 1;
        uint32_t rgb_upper_1 = r_upper_1 + (g_upper_1 << 1);
        uint32_t rgb_lower_1 = r_lower_1 + (g_lower_1 << 1);
        uint32_t rgb_upper_2 = r_upper_2 + (g_upper_2 << 1);
        uint32_t rgb_lower_2 = r_lower_2 + (g_lower_2 << 1);

        // 上記の変数の中身は BGRBGRBGRBGR… の順にビットが並んだ状態となる
        // これを、各色の0,2,4,6ビットと1,3,5,7ビットの成分に分離する
        uint32_t rgb_upper_1_even = rgb_upper_1 & 0b00111000111000111000111000111000;
        uint32_t rgb_upper_1_odd  = rgb_upper_1 & 0b11000111000111000111000111000111;
        uint32_t rgb_lower_1_even = rgb_lower_1 & 0b00111000111000111000111000111000;
        uint32_t rgb_lower_1_odd  = rgb_lower_1 & 0b11000111000111000111000111000111;
        uint32_t rgb_upper_2_even = rgb_upper_2 & 0b00111000111000111000111000111000;
        uint32_t rgb_upper_2_odd  = rgb_upper_2 & 0b11000111000111000111000111000111;
        uint32_t rgb_lower_2_even = rgb_lower_2 & 0b00111000111000111000111000111000;
        uint32_t rgb_lower_2_odd  = rgb_lower_2 & 0b11000111000111000111000111000111;

        // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
        uint32_t rgb_even_1 = (rgb_lower_1_even    ) + (rgb_upper_1_even >> 3);
        uint32_t rgb_odd_1  = (rgb_lower_1_odd << 3) + (rgb_upper_1_odd      );
        uint32_t rgb_even_2 = (rgb_lower_2_even    ) + (rgb_upper_2_even >> 3);
        uint32_t rgb_odd_2  = (rgb_lower_2_odd << 3) + (rgb_upper_2_odd      );

        d32[0] = mixdata[8]; // TRANSFER_PERIOD_COUNT565

        uint32_t i = 0;
        do
        {
          uint32_t odd_2 = rgb_odd_2 & 0x3F;
          uint32_t odd_1 = rgb_odd_1 & 0x3F;
          uint32_t even_2 = rgb_even_2 & 0x3F;
          uint32_t even_1 = rgb_even_1 & 0x3F;
          rgb_odd_2 >>= 6;
          rgb_odd_1 >>= 6;
          odd_2 += mixdata[i] + (odd_1 << 16);
          // 奇数番ビット成分を横２列ぶん同時にバッファにセットする
          d32[++i * len32] = odd_2;
          even_2 += mixdata[i] + (even_1 << 16);
          rgb_even_2 >>= 6;
          rgb_even_1 >>= 6;
          // 偶数番ビット成分を横２列ぶん同時にバッファにセットする
          d32[++i * len32] = even_2;
        } while (i < 8); // TRANSFER_PERIOD_COUNT565
        ++d32;
      } while (--xe);
      if (xe_idx == 8) break; // TRANSFER_PERIOD_COUNT_565
      uint32_t new_xe = xe_tbl[xe_idx] >> 1;
      uint32_t old_xe;
      do {
        old_xe = new_xe;
        mixdata[++xe_idx] = work->mix_value;
        new_xe = xe_tbl[xe_idx] >> 1;
      } while (new_xe <= old_xe);
      xe = new_xe - old_xe;
    }
  }
//*/

